app/Views/kelas/v_kelas.php

                    $no = 1;
                    foreach ($kelas as $key => $value) {

                        $jml = $db->table('tbl_siswa')->where('id_kelas', $value['id_kelas'])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_siswa`
WHERE `id_kelas` = '1'