app/Models/ModelKrs.php

SELECT *
FROM `tbl_siswa`
LEFT JOIN `tbl_kelas` ON `tbl_kelas`.`id_kelas` = `tbl_siswa`.`id_kelas`
LEFT JOIN `tbl_guru` ON `tbl_guru`.`id_guru` = `tbl_kelas`.`id_guru`
WHERE `nis` = 'admin'
---
    public function daftarap($id_kelas, $id_ta)
    {
        return $this->db->table('tbl_jadwal')
            ->join('tbl_guru', 'tbl_guru.nip = tbl_jadwal.nip', 'left')
            ->join('tbl_mapel', 'tbl_mapel.kode_mapel = tbl_jadwal.kode_mapel', 'left')
            ->join('tbl_kelas', 'tbl_kelas.id_kelas = tbl_jadwal.id_kelas', 'left')
            ->join('tbl_siswa', 'tbl_siswa.nis = tbl_jadwal.id_kelas', 'left')