app/Models/ModelKelas.php

    public function allData()
    {
        return $this->db->table('tbl_kelas')
            ->join('tbl_guru', 'tbl_guru.id_guru = tbl_kelas.id_guru', 'left')
            // ->join('tbl_mapel', 'tbl_mapel.id_kelas = tbl_kelas.id_kelas', 'left')
            ->orderBy('tbl_kelas.id_guru', 'ASC')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_kelas`
LEFT JOIN `tbl_guru` ON `tbl_guru`.`id_guru` = `tbl_kelas`.`id_guru`
ORDER BY `tbl_kelas`.`id_guru` ASC

    public function detail($id_kelas)
    {
        return $this->db->table('tbl_kelas')
            ->join('tbl_guru', 'tbl_guru.id_guru = tbl_kelas.id_guru', 'left')
            ->where('id_kelas', $id_kelas)
            ->get()->getRowArray();
---
SELECT *
FROM `tbl_kelas`
LEFT JOIN `tbl_guru` ON `tbl_guru`.`id_guru` = `tbl_kelas`.`id_guru`
WHERE `id_kelas` = '1'

    public function siswa($id_kelas)
    {
        // menampilkan siswa berdasarkan kelas
        return $this->db->table('tbl_siswa')->orderBy('id_siswa', 'DESC')
            ->where('id_kelas', $id_kelas)
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_siswa`
WHERE `id_kelas` = '1'
ORDER BY `id_siswa` DESC

    public function siswa_nokel()
    {
        return $this->db->table('tbl_siswa')
            ->where('id_kelas', null)
            ->orderBy('id_siswa', 'DESC')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_siswa`
WHERE `id_kelas` IS NULL
ORDER BY `id_siswa` DESC

    public function jumlah($id_kelas)
    {
        return $this->db->table('tbl_siswa')
            ->where('id_kelas', $id_kelas)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_siswa`
WHERE `id_kelas` = '1'