app/Models/ModelJadwal.php

    public function allData($id_kelas, $id_ta)
    {
        return $this->db->table('tbl_jadwal')
            ->join('tbl_mapel', 'tbl_mapel.kode_mapel = tbl_jadwal.kode_mapel', 'left')
            ->join('tbl_kelas', 'tbl_kelas.id_kelas = tbl_jadwal.id_kelas', 'left')
            ->join('tbl_ta', 'tbl_ta.id_ta = tbl_kelas.id_ta', 'left')
            ->join('tbl_guru', 'tbl_guru.nuptk = tbl_jadwal.nuptk', 'left')
            ->where('tbl_jadwal.id_kelas', $id_kelas)
            ->where('tbl_kelas.id_ta', $id_ta)
            // ->orderBy('tbl_mapel.smt', 'ASC')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_jadwal`
LEFT JOIN `tbl_mapel` ON `tbl_mapel`.`id_mapel` = `tbl_jadwal`.`id_mapel`
LEFT JOIN `tbl_kelas` ON `tbl_kelas`.`id_kelas` = `tbl_jadwal`.`id_kelas`
LEFT JOIN `tbl_guru` ON `tbl_guru`.`id_guru` = `tbl_jadwal`.`id_guru`
WHERE `tbl_jadwal`.`id_kelas` = '1'
ORDER BY `tbl_mapel`.`smt` ASC
SELECT *
FROM `tbl_mapel`
WHERE `id_kelas` = '1'
ORDER BY `smt` ASC

    public function gurumapel()
    {
        return $this->db->table('tbl_guru')
            ->get()->getRowArray();
---
SELECT *
FROM `tbl_guru`