app/Models/ModelMapel.php

SELECT *
FROM `tbl_mapel`
ORDER BY `id_mapel` DESC
---
    public function allData()
    {
        return $this->db->table('tbl_mapel')
            ->orderBy('id_mapel', 'DESC')
            ->get()->getResultArray();