app/Models/ModelLogin.php

SELECT *
FROM `tbl_user`
WHERE `username` = 'admin'
AND `password` = 'admin'
---
    public function login_user($username, $password){
        return $this->db->table('tbl_user')->where([
            'username'=> $username,
            'password' => $password
        ])->get()->getRowArray();