app/Models/ModelProdi.php

    public function allData()
    {
        return $this->db->table('tbl_prodi')
            ->orderBy('tbl_prodi.id_prodi', 'ASC')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_prodi`
ORDER BY `tbl_prodi`.`id_prodi` ASC