app/Models/ModelTa.php

SELECT *
FROM `tbl_ta`
ORDER BY `id_ta` DESC
---
    public function allData()
    {
        return $this->db->table('tbl_ta')->orderBy('id_ta', 'DESC')->get()->getResultArray();

SELECT *
FROM `tbl_ta`
WHERE `status` = 1
---
    public function ta_aktif()
    {
        return $this->db->table('tbl_ta')->where('status', 1)
            ->get()
            ->getRowArray();